anthropic.claude-code
github.github-vscode-theme
james-yu.latex-workshop
leanprover.lean4
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
openai.chatgpt
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tecosaur.latex-utilities
