tap "homebrew-zathura/zathura", trusted: true
tap "kpeeters/repo", trusted: true
# Spell checker with better logic than ispell
brew "aspell"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# LLVM's OpenMP runtime library
brew "libomp"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Command-driven, interactive function plotting
brew "gnuplot"
# Numerical library for C and C++
brew "gsl"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# File format designed to store large amounts of data
brew "hdf5"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full"
# Julia installer and version multiplexer
brew "juliaup"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Interactive environments for writing and running code
brew "jupyterlab"
# Library of exchange and correlation functionals for codes
brew "libxc"
# Next-gen compiler infrastructure
brew "llvm"
# Small build system for use with gyp or CMake
brew "ninja"
# Terminal-based visual file manager
brew "midnight-commander"
# POSIX *nix fetch script using Nerdfonts
brew "nerdfetch"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Portable Archive Interchange archive tool
brew "pax"
# Highly capable, feature-rich programming language
brew "perl"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python library for creating static, animated, and interactive visualizations
brew "python-matplotlib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Software for mathematics, science, and engineering
brew "scipy"
# Find and verify credentials
brew "trufflehog", link: false
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# PDF viewer
brew "homebrew-zathura/zathura/zathura", args: ["with-synctex"]
# Comic book plugin for zathura
brew "homebrew-zathura/zathura/zathura-cb"
# DJVU plugin for zathura
brew "homebrew-zathura/zathura/zathura-djvu"
# MuPDF backend plugin for zathura
brew "homebrew-zathura/zathura/zathura-pdf-mupdf"
# Poppler backend plugin for zathura
brew "homebrew-zathura/zathura/zathura-pdf-poppler"
# Postscript backend plugin for zathura
brew "homebrew-zathura/zathura/zathura-ps"
# A field-theory motivated approach to computer algebra.
brew "kpeeters/repo/cadabra2"
# Enable Windows-like alt-tab
cask "alt-tab"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Graphical interface for LaTeX
cask "latexit"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Mathematics software system
cask "sage"
# System monitor for the menu bar
cask "stats"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "anthropic.claude-code"
vscode "github.github-vscode-theme"
vscode "james-yu.latex-workshop"
vscode "leanprover.lean4"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "openai.chatgpt"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
cargo "bend-lang"
cargo "hvm"
